package com.pathfinder.server.tourinfo.service;

import org.springframework.stereotype.Component;

@Component
public class TourInfoCities {
    String[] address =
        {"가평", "고양", "과천", "광명",
            "광주", "구리", "군포", "김포",
            "남양주", "동두천", "부천", "서울",
            "성남", "수원", "시흥", "안산",
            "안성", "안양", "양주", "양평",
            "여주", "연천", "오산", "용인",
            "의왕", "의정부", "이천", "인천",
            "파주", "평택", "포천", "하남",
            "화성", "강릉", "고성", "동해", "삼척",
            "속초", "양구", "양양", "영월",
            "원주", "인제", "정선", "철원",
            "춘천", "태백", "평창", "홍천",
            "화천", "횡성",  "계룡", "공주", "괴산", "금산",
            "논산", "단양", "당진", "대전",
            "보령", "보은", "부여", "서산",
            "서천", "세종", "아산", "영동",
            "예산", "옥천", "음성", "제철",
            "증평", "진천", "천안", "청양",
            "청주", "충주", "태안", "홍성",
            "거제", "거창", "경산", "경주",
            "고령", "고성", "구미", "김천",
            "김해", "남해", "대구", "문경",
            "밀양", "봉화", "부산", "사천",
            "산청", "상주", "성주", "안동",
            "양산", "영덕", "영양", "영주",
            "영천", "예천", "울릉", "울산",
            "울진", "의령", "의성", "진주",
            "창녕", "창원", "청도", "청송",
            "칠곡", "통영", "포항", "하동",
            "함안", "함양", "합천", "강진", "고창", "고흥", "곡성",
            "광양", "광주", "구례", "군산",
            "김제", "나주", "남원", "담양",
            "목포", "무안", "무주", "보성",
            "부안", "순창", "순천", "신안",
            "여수", "영광", "영암", "완도",
            "완주", "익산", "임실", "장성",
            "장수", "장흥", "전주", "정읍",
            "진도", "진안", "함평", "해남",
            "화순", "서귀포", "제주"
    };
}
